Harinadha/STM32_MPU9150eMPL/main.c
}
/* Every time new gyro data is available, this function is called in an
 * ISR context. In this example, it sets a flag protecting the FIFO read
 * function.
 */
void EXTI9_5_IRQHandler(void) 
{  
   if(EXTI_GetITStatus(EXTI_Line9))
   {             
     if(MPU9150_Get_INTpin_State())
     {
       hal.new_gyro = 1;
     }
     EXTI_ClearITPendingBit(EXTI_Line9);        
   }   
}
/* Simple application code for testing MPU9150 with STM32F103xx family microcontrollers.
 * It initializes Clock system, USB, I2C & MPU9150. Listens to the data received on Virtual
 * COM port, constructs commands & executes them.
 */
void Stm32MPU9150test(void)
{
    int result;
    unsigned char accel_fsr;
    unsigned short gyro_rate, gyro_fsr;
    //unsigned long timestamp;
    //struct int_param_s int_param;
    /**************************** Setup STM32 hardware ***********************/
    Set_System();
    Set_USBClock();
    USB_Interrupts_Config();
    USB_Init();
    /************ 1. Initialize CPAL for I2C communication with MPU9150 *****/
    Delay(993400); // USB configuration takes some time ( useful in case USB not present)
    //while(bDeviceState != CONFIGURED); // If USB present, Wait until USB is configured
    MPU9150_Config();
    if(MPU9150_GetStatus() == SUCCESS)
    {
      Virtual_Com_Write_Buffer("MPU9150-Status is fine", 22);  
    }
    /******** 2. Configure INT pin of STM32 for MPU9150 interrupts *********/
    MPU9150_Interrupt_Init(MPU9150_INT_MODE_EXTI);
    /* If you're not using an MPU9150 AND you're not using DMP features, this
     * function will place all slaves on the primary bus.
     * mpu_set_bypass(1);
     */
    /* Get/set hardware configuration. Start gyro. */
    /* Wake up all sensors. */
    int t_err = mpu_set_sensors(INV_XYZ_GYRO | INV_XYZ_ACCEL);
    /* Push both gyro and accel data into the FIFO. */
    t_err = mpu_configure_fifo(INV_XYZ_GYRO | INV_XYZ_ACCEL);
    t_err = mpu_set_sample_rate(DEFAULT_MPU_HZ);
    t_err = mpu_set_gyro_fsr(2000);
    /* Read back configuration in case it was set improperly. */
    t_err = mpu_get_sample_rate(&gyro_rate);
    t_err = mpu_get_gyro_fsr(&gyro_fsr);
    t_err = mpu_get_accel_fsr(&accel_fsr);

    /* Initialize HAL state variables. */
    memset(&hal, 0, sizeof(hal));
    hal.sensors = ACCEL_ON | GYRO_ON;
    hal.report = PRINT_QUAT;

    /* To initialize the DMP:
     * 1. Call dmp_load_motion_driver_firmware(). This pushes the DMP image in
     *    inv_mpu_dmp_motion_driver.h into the MPU memory.
     * 2. Push the gyro and accel orientation matrix to the DMP.
     * 3. Register gesture callbacks. Don't worry, these callbacks won't be
     *    executed unless the corresponding feature is enabled.
     * 4. Call dmp_enable_feature(mask) to enable different features.
     * 5. Call dmp_set_fifo_rate(freq) to select a DMP output rate.
     * 6. Call any feature-specific control functions.
     *
     * To enable the DMP, just call mpu_set_dmp_state(1). This function can
     * be called repeatedly to enable and disable the DMP at runtime.
     *
     * The following is a short summary of the features supported in the DMP
     * image provided in inv_mpu_dmp_motion_driver.c:
     * DMP_FEATURE_LP_QUAT: Generate a gyro-only quaternion on the DMP at
     * 200Hz. Integrating the gyro data at higher rates reduces numerical
     * errors (compared to integration on the MCU at a lower sampling rate).
     * DMP_FEATURE_6X_LP_QUAT: Generate a gyro/accel quaternion on the DMP at
     * 200Hz. Cannot be used in combination with DMP_FEATURE_LP_QUAT.
     * DMP_FEATURE_TAP: Detect taps along the X, Y, and Z axes.
     * DMP_FEATURE_ANDROID_ORIENT: Google's screen rotation algorithm. Triggers
     * an event at the four orientations where the screen should rotate.
     * DMP_FEATURE_GYRO_CAL: Calibrates the gyro data after eight seconds of
     * no motion.
     * DMP_FEATURE_SEND_RAW_ACCEL: Add raw accelerometer data to the FIFO.
     * DMP_FEATURE_SEND_RAW_GYRO: Add raw gyro data to the FIFO.
     * DMP_FEATURE_SEND_CAL_GYRO: Add calibrated gyro data to the FIFO. Cannot
     * be used in combination with DMP_FEATURE_SEND_RAW_GYRO.
     */
    t_err = dmp_load_motion_driver_firmware();
    t_err = dmp_set_orientation(inv_orientation_matrix_to_scalar(gyro_orientation));
    t_err = dmp_register_tap_cb(tap_cb);
    t_err = dmp_register_android_orient_cb(android_orient_cb);
    hal.dmp_features = DMP_FEATURE_6X_LP_QUAT | DMP_FEATURE_TAP |
        DMP_FEATURE_ANDROID_ORIENT | DMP_FEATURE_SEND_RAW_ACCEL | DMP_FEATURE_SEND_CAL_GYRO |
        DMP_FEATURE_GYRO_CAL;
    t_err = dmp_enable_feature(hal.dmp_features);
    t_err = dmp_set_fifo_rate(DEFAULT_MPU_HZ);
    t_err = mpu_set_dmp_state(1);
    hal.dmp_on = 1;
		/************** 3. Enable the Interrupt now **************************/
    MPU9150_Interrupt_Cmd(ENABLE);
		
    while (1) {
        unsigned long sensor_timestamp;
        if (count_out != 0)
            /* A byte has been received via USB. See handle_input for a list of
             * valid commands.
             */
        {   
            handle_input();				   		
            count_out = 0; // received data has been processed
				}

        if (hal.motion_int_mode) {
            /* Enable motion interrupt. */
            mpu_lp_motion_interrupt(500, 1, 5);
            hal.new_gyro = 0;
            /* Wait for the MPU interrupt. */
            while (!hal.new_gyro){
						//Write code for Low Power Mode (LPM)
						}
            /* Restore the previous sensor configuration. */
            mpu_lp_motion_interrupt(0, 0, 0);
            hal.motion_int_mode = 0;
        }

        if (!hal.sensors || !hal.new_gyro) {
            /* Put the stm32 to sleep until a timer interrupt or data ready
             * interrupt is detected.
             */            
            //continue;
        }

        if (hal.new_gyro && hal.dmp_on) {
            short gyro[3], accel[3], sensors;
            unsigned char more;
            long quat[4];
            /* This function gets new data from the FIFO when the DMP is in
             * use. The FIFO can contain any combination of gyro, accel,
             * quaternion, and gesture data. The sensors parameter tells the
             * caller which data fields were actually populated with new data.
             * For example, if sensors == (INV_XYZ_GYRO | INV_WXYZ_QUAT), then
             * the FIFO isn't being filled with accel data.
             * The driver parses the gesture data to determine if a gesture
             * event has occurred; on an event, the application will be notified
             * via a callback (assuming that a callback function was properly
             * registered). The more parameter is non-zero if there are
             * leftover packets in the FIFO.
             */
            dmp_read_fifo(gyro, accel, quat, &sensor_timestamp, &sensors,
                &more);
            if (!more)
                hal.new_gyro = 0;
            /* Gyro and accel data are written to the FIFO by the DMP in chip
             * frame and hardware units. This behavior is convenient because it
             * keeps the gyro and accel outputs of dmp_read_fifo and
             * mpu_read_fifo consistent.
             */
            if (sensors & INV_XYZ_GYRO && hal.report & PRINT_GYRO)
                send_packet(PACKET_TYPE_GYRO, gyro);
            if (sensors & INV_XYZ_ACCEL && hal.report & PRINT_ACCEL)
                send_packet(PACKET_TYPE_ACCEL, accel);
            /* Unlike gyro and accel, quaternions are written to the FIFO in
             * the body frame, q30. The orientation is set by the scalar passed
             * to dmp_set_orientation during initialization.
             */
            if (sensors & INV_WXYZ_QUAT && hal.report & PRINT_QUAT)
                send_packet(PACKET_TYPE_QUAT, quat);
        } else if (hal.new_gyro) {
            short gyro[3], accel[3];
            unsigned char sensors, more;
            /* This function gets new data from the FIFO. The FIFO can contain
             * gyro, accel, both, or neither. The sensors parameter tells the
             * caller which data fields were actually populated with new data.
             * For example, if sensors == INV_XYZ_GYRO, then the FIFO isn't
             * being filled with accel data. The more parameter is non-zero if
             * there are leftover packets in the FIFO.
             */
            mpu_read_fifo(gyro, accel, &sensor_timestamp, &sensors, &more);
            if (!more)
                hal.new_gyro = 0;
            if (sensors & INV_XYZ_GYRO && hal.report & PRINT_GYRO)
                send_packet(PACKET_TYPE_GYRO, gyro);
            if (sensors & INV_XYZ_ACCEL && hal.report & PRINT_ACCEL)
                send_packet(PACKET_TYPE_ACCEL, accel);
        }
    }
}

void SimpleUSBvirtualCOMtest()
{
   Set_System();
   Set_USBClock(); 
   NVIC_PriorityGroupConfig(NVIC_PriorityGroup_1);
   USB_Interrupts_Config();
   USB_Init();
   while(bDeviceState != CONFIGURED); // wait until USB is configured	
   while (1)
   { 
    if(count_out)
    {
      Virtual_Com_Write_Buffer(&USB_Rx_Buffer, count_out);  // Just send whatever received on USB
      count_out = 0;
    }
   }
}
/*******************************************************************************
* Function Name  : main.
* Description    : Main routine.
* Input          : None.
* Output         : None.
* Return         : None.
*******************************************************************************/
int main()
{
  //SimpleUSBvirtualCOMtest();
  Stm32MPU9150test();
  return 0;
}

#ifdef USE_FULL_ASSERT
/*******************************************************************************
* Function Name  : assert_failed
* Description    : Reports the name of the source file and the source line number
*                  where the assert_param error has occurred.
* Input          : - file: pointer to the source file name
*                  - line: assert_param error line source number
* Output         : None
* Return         : None
*******************************************************************************/
void assert_failed(uint8_t* file, uint32_t line)
{
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */

  /* Infinite loop */
  while (1)
  {}
}
#endif